Autodesk.Revit.DB.ViewSheet.SheetCollectionId
The ID of the sheet collection this sheet is associated with.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: Assembly Sheets can't be SheetCollections.
-or-
When setting this property: The ElementId sheetCollectionId does not correspond to the SheetCollection.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2025